{--1-1
Описать функцию f n, которая вычисляет 
1+1/(1+1/(1+ ...+1/1)) - n дробей

Пример вызова:
f 3
Должно получиться 1+1/(1+1/(1+1/1)), то есть 1.6666.. 
--}
f 1 = 1 + 1 / 1
f n = 1 + 1 / (f (n-1))



--------------------------------------------------------------------------
--------------------------------------------------------------------------
{-- 1-2
Описать функцию b n, которая вычисляет 
0+1/(1+1/(2+1/(3+ ...+1/n))) - n дробей

Пример вызова:
b 3
Должно получиться 0+1/(1+1/(2+1/3)), то есть 0.7--}
b' 1 p = 1/p
b' n p = 1/ ( (p - n + 1) + b' (n-1) p )

b 0 = 0
b n = b' n n





--------------------------------------------------------------------------
--------------------------------------------------------------------------
{-- 1-3
Описать функцию 
sumsqr n = (1+2+...+n)^2/(1^2 + 2^2 + ... + n^2))

Напоминание: ^ - это операция возведения в степень.

Дополнительное условие: В этой задаче, пожалуйста, обязательно используйте хвостовую рекурсию и накапливающие параметры.

Пример вызова:
sumsqr 2 
Должно получиться 1.8
--}

{--
sum1 1 p = 1
sum1 n p = (2*(p - n + 1) - 1) * ((p - n + 1)+1) / (2*(p - n + 1) + 1) / ((p - n + 1) - 1) * sum1 (n-1) p
sumsqr n = sum1 n (n+1) 
--}

sum1 a b 0 = a ^ 2 / b
sum1 a b n = sum1 (a + n) (b + n^2) (n-1)   
sumsqr n = sum1 0 0 n


--it's better
--sumsqr n = ((1+n)*n/2)^ 2 / (n*(n+1)*(2*n+1)/6) = ((1+n)*n/2) / ((2*n+1)/3) = 3/2 * n * (n+1) / (2n+1)




--------------------------------------------------------------------------
--------------------------------------------------------------------------
{-- 1-4
	Описать функцию sumfact n: 
sumfact n = 1!+2!+...+n!
В решении желательно (но не обязательно) использовать хвостовую рекурсию и накапливающие параметры.

Пример вызова:
sumfact 3
Результат должен быть равен 9.

Решение: 1! + 2! + 3! + 4! == 1(1 + 2(1 + 3(1+ 4)))
--}
sf 1 p = p
sf n p = (p - n + 1)*(1 + sf (n-1) p)
sumfact n = sf n n




